In [ ]:
'''
Data Science BI suit
   SQL - data store and retrieve
   ETL - transfer and manipulate data
   Tableau -  Visualization
   Data Science - Predict pattern
'''

# Loading Data and Data Clean up

In [1]:
import pandas as pd  #import Panda library

View Sample

In [10]:
#pipe delimited sample data
reads = pd.read_table('https://www.nrc.gov/reading-rm/doc-collections/event-status/reactor-status/2009/2009PowerStatus.txt')
reads.head()

                 ReportDt|Unit|Power
0  12/31/2009|Arkansas Nuclear 1|100
1  12/31/2009|Arkansas Nuclear 2|100
2     12/31/2009|Beaver Valley 1|100
3     12/31/2009|Beaver Valley 2|100
4         12/31/2009|Braidwood 1|100

In [11]:
#Pipe Separator 
reads = pd.read_table('https://www.nrc.gov/reading-rm/doc-collections/event-status/reactor-status/2009/2009PowerStatus.txt', sep='|')
reads.head()

     ReportDt                Unit  Power
0  12/31/2009  Arkansas Nuclear 1    100
1  12/31/2009  Arkansas Nuclear 2    100
2  12/31/2009     Beaver Valley 1    100
3  12/31/2009     Beaver Valley 2    100
4  12/31/2009         Braidwood 1    100

In [12]:
#tsv
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [13]:
#choose certain columns
cols=['Name','Position']
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee[cols].head()

             Name                       Position
0      Airi Satou                     Accountant
1  Angelica Ramos  Chief Executive Officer (CEO)
2      Ashton Cox        Junior Technical Author
3   Bradley Greer              Software Engineer
4  Brenden Wagner              Software Engineer

In [14]:
#choose certain rows
employee = pd.read_table('DataTablesExample_TSV.tsv', nrows = 4)
employee

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"

Data types

In [15]:
#display datatypes
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.dtypes

Name          object
Position      object
Office        object
Age            int64
Start date    object
Salary        object
dtype: object

In [16]:
#display integer datatypes
import numpy as np

employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.select_dtypes(include = [np.number]).dtypes

Age    int64
dtype: object

inbuilt methods for data analysis

In [17]:
employee.describe() #statistics with int

             Age
count  57.000000
mean   42.736842
std    14.877507
min    19.000000
25%    30.000000
50%    42.000000
75%    56.000000
max    66.000000

In [18]:
employee.shape #number of rows and columns

(57, 6)

In [19]:
type(employee) #type of object

pandas.core.frame.DataFrame

In [ ]:
employee = pd.read_table('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/DataTablesExample_TSV.tsv')
employee.head()

In [ ]:
#concatinating 2 columns
employee['Name Salary']=employee['Name']+employee['Salary']
employee.head()

In [ ]:
employee.drop('Office', axis=1, inplace=True)
employee.head()

In [ ]:
employee = pd.read_table('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/DataTablesExample_TSV.tsv')
employee.head()

In [ ]:
#renaming column
cols =['Name','Posistion', 'Ofc','Age','SDate','Sal']
employee.columns = cols
employee.head()

In [ ]:
employee = pd.read_table('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/DataTablesExample_TSV.tsv')
employee.head()

In [ ]:
#sorting Data
employee.sort_values(by='Age', ascending=True).head()

In [ ]:
employee['Name'].sort_values()

In [ ]:
#filtering
employee[employee.Age<25]

In [ ]:
employee[(employee.Age<25) & (employee.Name == 'Shou Itou')]

In [ ]:
cols = ['Name' , 'Position']
employee[employee.Age<25][cols].head()

In [ ]:
employee.head()

In [ ]:
employee.mean()

In [ ]:
employee.Name.str.upper().head()

In [ ]:
employee.Name.str.lower().head()

In [ ]:
employee.Position.str.contains('Software')

In [ ]:
employee[employee.Position.str.contains('Software')]

In [ ]:
employee.head()
employee.Position.str.replace('Engineer','Developer')

In [ ]:
employee.Age.min()

In [ ]:
employee.Age.max()

In [ ]:
employee.groupby('Position').Age.min()

In [ ]:
employee.groupby('Position').Age.agg(['count','min','max'])

In [ ]:
#loc - choose number of rows and column
employee = pd.read_table('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/DataTablesExample_TSV.tsv')

#row 0, all col
employee.loc[0, :]

In [ ]:
#row 0-2, all col
employee.loc[0:2, :]

In [ ]:
#row 0-2, 2 col
employee.loc[0:2, ['Name','Position']]

In [ ]:
#row 0-2, 3 col
employee.loc[0:2, 'Name':'Office']

In [ ]:
#rows with certain condition
employee.loc[employee.Position == 'Accountant',:]

In [ ]:
#dropna - drop rows with missing values
employee = pd.read_table('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/dropnaExample_TSV.tsv')
employee.head()

In [ ]:
employee.shape

In [ ]:
#drop values with all missing values in any columns
employee.dropna(how='any').shape

In [ ]:
#drop values with all missing values in specific columns
employee.dropna(subset=['Name','Salary']).shape

In [ ]:
#fillna

In [ ]:
milkprod = pd.read_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/MonthlyMilkProduction.csv')
milkprod.head()

In [ ]:
milkprod.plot()

In [ ]:
#joins

#create dummy data
dataframe1 = pd.DataFrame({
    "employee":["ABC","XYZ","PQR"],
    "salary":["100000","125000","80000"]
})

dataframe1

In [ ]:
dataframe2 = pd.DataFrame({
    "employee":["ABC","XYZ","LMN"],
    "salary":["100000","125000","90000"]
})

dataframe2

In [ ]:
#inner join
dataframe3 = pd.merge(dataframe1,dataframe2, on='employee')
dataframe3

In [ ]:
#outer join
dataframe3 = pd.merge(dataframe1,dataframe2, on='employee', how='outer')
dataframe3

In [ ]:
#left join
dataframe3 = pd.merge(dataframe1,dataframe2, on='employee', how='left')
dataframe3

In [ ]:
#right join
dataframe3 = pd.merge(dataframe1,dataframe2, on='employee', how='right')
dataframe3

In [ ]:
#pivot
webtraffic = pd.read_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/PivotExample.csv')
webtraffic

In [ ]:
webtraffic.pivot(index='Page_name', columns='Date')

In [ ]:
#Pivot table
webtraffic.pivot_table(index='Page_name', aggfunc='sum')

In [ ]:
#Pivot table
webtraffic.pivot_table(index='Page_name', aggfunc='mean')

In [ ]:
#Pivot table
webtraffic.pivot_table(index='Page_name', aggfunc='count')

In [ ]:
#shift
fb_finance = pd.read_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/FB.csv')
fb_finance.head()

In [ ]:
fb_finance.shift(1).head()

In [ ]:
fb_finance.shift(-1).head()

In [ ]:
#calculate stock price delta
fb_finance['previous_closing_price']=fb_finance['Close'].shift(1)
fb_finance.head()

In [ ]:
fb_finance['previous_closing_price'] = fb_finance['previous_closing_price']-fb_finance['Close']
fb_finance.head()

In [ ]:
fb_finance['weekly returns'] = (fb_finance['Close']-fb_finance['Close'].shift(7))/fb_finance['Close']*100
fb_finance

In [ ]:
#write to csv
fb_finance.to_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/FB.csv')

In [ ]:
#write to csv columns
fb_finance.to_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/FB.csv', columns=['Volume','weekly returns'])